//
//  QuantizationTables.hpp
//  AaSD_Jpeg_laba2
//
//  Created by Егор on 03.05.2025.
//

#ifndef QuantizationTables_hpp
#define QuantizationTables_hpp

#include <array>

// Стандартная матрица квантования для яркости (Luma) из JPEG стандарта
constexpr std::array<std::array<int, 8>, 8> DEFAULT_LUMA_QUANT_TABLE = {{
    {16, 11, 10, 16, 24, 40, 51, 61},
    {12, 12, 14, 19, 26, 58, 60, 55},
    {14, 13, 16, 24, 40, 57, 69, 56},
    {14, 17, 22, 29, 51, 87, 80, 62},
    {18, 22, 37, 56, 68, 109, 103, 77},
    {24, 35, 55, 64, 81, 104, 113, 92},
    {49, 64, 78, 87, 103, 121, 120, 101},
    {72, 92, 95, 98, 112, 100, 103, 99}
}};

// Стандартная матрица квантования для цветности (Chroma)
constexpr std::array<std::array<int, 8>, 8> DEFAULT_CHROMA_QUANT_TABLE = {{
    {17, 18, 24, 47, 99, 99, 99, 99},
    {18, 21, 26, 66, 99, 99, 99, 99},
    {24, 26, 56, 99, 99, 99, 99, 99},
    {47, 66, 99, 99, 99, 99, 99, 99},
    {99, 99, 99, 99, 99, 99, 99, 99},
    {99, 99, 99, 99, 99, 99, 99, 99},
    {99, 99, 99, 99, 99, 99, 99, 99},
    {99, 99, 99, 99, 99, 99, 99, 99}
}};

#endif /* QuantizationTables_hpp */
